Repository: Yochiyan/DrinkUp-NextWAY
Catalog: DrinkUp-NextWAY/Localizable.xcstrings
Source language: ja
Languages: en, ko

source: 「誰もが簡単に確実に水分摂取量を把握できるように、もっと水を飲もうとする気持ちを育む。」という想いから、DrinkUp!は生まれました。 このアプリは、ボトルの水分摂取量を数タップで簡単に記録できます。 日々の中で無理なく水分補給の習慣を身につけるためのシンプルなツールです。
en: "I named it \"DrinkUp!\" with the hope that you'll open it right as you finish the last drop. DrinkUp! is designed to help you track the water you drink from your water bottle with just a few taps, helping you develop healthy hydration habits. It's a simple and effective way to stay hydrated and make small, positive changes in your daily routine."
ko: “마지막 한 방울까지 다 마신 순간에 열어주었으면 한다”는 마음을 담아, DrinkUp!이라는 이름을 붙였습니다. 이 앱은 몇 번의 탭만으로 물병의 수분 섭취량을 간단하게 기록할 수 있습니다. 일상 속에서 무리 없이 수분 보충 습관을 기르기 위한 심플한 도구입니다.

source: 0以上の値を入力してください。
en: Please enter a value greater than or equal to 0.
ko: "0" 이상의 수치를 입력해주세요.

source: 1200 mlからそれ以上
en: 1200 ml or more
ko: 1200ml부터 그 이상

# About the Developer
source: 私たちについて
en: About the Developer
ko: 개발자 소개

source: DrinkUp!について
en: About DrinkUp!
ko: DrinkUp!에 대해서

source: DrinkUp!をリセット
en: Reset all data
ko: DrinkUp!을 초기화

source: Start!を押すと[プライバシーポリシー](https://cubic-bird-aa4.notion.site/DrinkUp-3527ee35cf148064968bc5e367f3eaf7)に同意したものとします。
en: By pressing Start!, you agree to the [Privacy Policy](https://cubic-bird-aa4.notion.site/English-35a7ee35cf1480d2a1bcd7d393a71900?source=copy_link).
ko: “Start!”를 누르면 [개인정보처리방침](https://cubic-bird-aa4.notion.site/3597ee35cf1480a9b75dc9355719db40?source=copy_link)에 동의한 것으로 간주됩니다.

# Why I made this app
source: なんでつくったの?
en: Why I made this app
ko: 제가 이 앱을 만든 이유

source: あなたの水筒で、簡単に正確な記録ができます。
en: Easily and accurately track hydration with your own bottle.
ko: 당신의 물병으로 간단하고 정확한 기록을 할 수 있습니다.

source: キャンセル
en: Cancel
ko: 취소

source: このシステムは、数字を視覚的なフィードバックに変換し成長と達成を通して習慣形成を促します。
en: This system turns numbers into visual feedback to encourage habit building through growth and achievement.
ko: 이 시스템은 숫자를 시각적인 피드백으로 변환하여, 성장과 달성을 통해 습관 형성을 촉진합니다.

source: このデバイスではヘルスケアが利用できません。対応デバイスでご利用ください。
en: Health is not available on this device. Please use a supported device.
ko: 이 기기에서는 의료 서비스를 사용할 수 없습니다. 대응 디바이스로 이용해 주십시오.

source: こんにちは！
en: Hello!
ko: 안녕하세요!

source: こんばんは！
en: Good evening!
ko: 안녕하세요!

source: チュートリアルを開始
en: Start Tutorial
ko: 튜토리얼 시작

source: プライバシーポリシー
en: Privacy Policy
ko: 개인정보처리방침

source: ヘルスケアへの書き込み権限が未設定です。初回の権限リクエストや、ヘルスケアアプリから設定できます。
en: Health write permission is not configured. You can allow it during the first permission request or in the Health app.
ko: 건강 관리에 대한 쓰기 권한이 설정되지 않았습니다. 최초 권한 요청과 건강 관리 앱에서 설정할 수 있습니다.

source: ヘルスケアへの書き込み権限が未許可です。ヘルスケアアプリを開いて許可してください。
en: Health write permission is denied. Please open the Health app and allow access.
ko: 건강 관리에 대한 쓰기 권한이 허용되지 않습니다. 의료 앱을 열고 허용하세요.

source: ヘルスケアへの書き込み権限は許可されています。
en: Health write permission is granted.
ko: 건강 관리에 대한 쓰기 권한은 허용됩니다.

source: ヘルスケアを開く
en: Open Health
ko: 건강 앱 열기

source: ヘルスケアを開く↗︎
en: Open Health ↗︎
ko: 건강 앱 열기↗︎

source: ヘルスケア書き込み: 一部のみ
en: Health Write: Partial
ko: 건강 관리 쓰기: 일부만

source: ヘルスケア書き込み: 利用不可
en: Health Write: Unavailable
ko: 건강 관리 쓰기: 사용 불가

source: ヘルスケア書き込み: 未設定
en: Health Write: Not Set
ko: 건강 관리 쓰기: 설정되지 않음

source: ヘルスケア書き込み: 未許可
en: Health Write: Denied
ko: 헬스케어 쓰기: 미허가

source: ヘルスケア書き込み: 許可
en: Health Write: Allowed
ko: 건강 관리 쓰기: 허용

source: ヘルスケア権限について
en: About Health Permissions
ko: 건강 앱 권한 안내

source: ヘルスケア連携
en: Health Integration
ko: 건강 앱 연동

source: マイボトル以外の水分補給
en: Hydration Outside My Bottle
ko: 내 물병 외의 수분 섭취

source: もしかして：超能力者ですか？
en: Wait... are you a psychic?
ko: 혹시... 초능력자이신가요?

source: リンク集
en: Links
ko: 링크 모음

source: 一部のみ許可されています。ヘルスケアアプリでDrinkUp!のアクセス権を見直してください。
en: Only partial access is allowed. Please review DrinkUp!'s permissions in the Health app.
ko: 일부만 허용됩니다. 건강 관리 앱에서 DrinkUp!의 액세스 권한을 검토하십시오.

source: 今まで: %lldml
en: Life time total: %lldml
ko: 지금까지 마신 양: %lldml

source: 今日:
en: Today:
ko: 오늘:

# 今日oz:
source: 今日:
en: Today:

source: 今週: %lldml
en: This Week: %lldml
ko: 이번주 마신 물:%lldml

source: 保存して閉じる
en: Save and Close
ko: 저장하고 닫기

source: 元に戻す
en: Undo
ko: 되돌리기

source: 最後にした記録が取り消されます。 iPhoneを投げないように気をつけてください★
en: Your most recent record will be removed. Please don't throw your iPhone ★
ko: 마지막 기록이 취소됩니다. iPhone을 집어던지지 않게 조심해주세요★

source: 単位
en: Unit
ko: 단위

source: 合計: %@
en: Total:%@
ko: 합계:%@

source: 合計: %lld ml
en: Total: %lld ml
ko: 합계:%lldml

source: 履歴
en: History
ko: 기록

source: 必要な水分量は性別や体型によって異なります。 Achievement Systemを過度に依存しないでください。
en: Your daily water needs depend on your gender and body size. Please do not rely excessively on the Achievement System.
ko: 필요한 수분 섭취량은 성별이나 체형에 따라 다릅니다.Achievement System에 너무 의존하지 마세요.

source: 扱うことのできない値が含まれています。
en: Contains unsupported values.
ko: 처리할 수 없는 값이 포함되어있습니다.

source: 本当にリセットしますか？ この操作は元に戻せません。
en: Are you sure you want to reset? This action cannot be undone.
ko: 정말로 초기화하시겠습니까? 이 작업은 되돌릴 수 없습니다.

source: 次へ
en: Next
ko: 다음으로

source: 毎日の水分摂取量状況を直感的に分かりやすく伝えます。
en: Understand your daily hydration status at a glance.
ko: 매일의 수분 섭취 상태를 직관적으로 알기 쉽게 전달합니다.

source: 水分をシンプルに記録
en: Track Hydration Simply
ko: 수분 섭취를 간편하게 기록

source: 水筒の中身を飲み切ったらタップ、 長押しで一時的に自由入力できます。
en: Tap when you finish your bottle, or long press for temporary manual input.
ko: 물병 안의 물을 다 마셨다면 탭하세요. 길게 누르면 일시적으로 직접 입력할 수 있습니다.

source: 注意！
en: Warning!
ko: 주의!

source: 注意！ 厚生労働省によると、成人の1日の最低水分摂取量は1.2Lです。実際の必要量は性別や体格によって異なります。この目安を過度に頼らないでください。
en: Warning! According to the Ministry of Health, Labour and Welfare, the minimum daily water intake for adults is 1.2L. Actual hydration needs vary depending on gender and body type. Please do not rely too heavily on this guideline. Required water intake varies depending on gender and body type.
ko: 주의! 일본 후생노동성에 따르면 성인의 하루 최소 수분 섭취량은 1.2L입니다. 실제 필요한 양은 성별과 체격에 따라 다릅니다. 이 기준에 지나치게 의존하지 마세요.

source: 直近の記録が取り消されました！
en: The latest record has been undone!
ko: 직전 기록이 취소되었습니다!

source: 簡単に水分補給の記録ができます。
en: Easily record your hydration.
ko: 간단하게 수분 섭취를 기록할 수 있습니다.

source: 続ける
en: Continue
ko: 계속하기

source: 英語翻訳
en: English Translation
ko: 영어 번역

source: 製作者
en: Created by
ko: 만든 이

source: 設定
en: Settings
ko: 설정

source: 許可された場合のみ ヘルスケアに水分データを書き込みます。 データはデバイス内で管理され、 開発者が取得することはありません。 許可しない場合でもアプリは通常通り利用できます。
en: Only when permission is granted, hydration data will be written to Health. All data is stored on your device, and is never collected by the developer. The app works normally even without permission.
ko: 허용된 경우에만 헬스케어에 수분 데이터를 기록합니다. 데이터는 디바이스 내부에서 관리되며, 개발자가 이를 취득하는 일은 없습니다. 허용하지 않아도 앱은 정상적으로 이용할 수 있습니다.

source: 追加
en: Add
ko: 추가

# 連続日数: %lld日
source: %lld日連続
en: %lld streak day
ko: %lld일연속

source: 閉じる
en: Close
ko: 닫기

source: 間違えたらiPhoneを振る
en: Shake your iPhone if you make a mistake
ko: 실수했을 땐 iPhone을 흔드세요

source: 韓国のお友達🫰🏻
en: A friend from Korea🫰🏻
ko: 내 한국 친구 🫰🏻

source: 韓国語翻訳
en: Korean Translation
ko: 한국어 번역

source: 飲んだら青いボタンを押す
en: Press the blue button after drinking
ko: 마셨다면 파란 버튼을 누르세요

source: ボトル内容量(%@)
ko: 물병 용량(%@)

source: マイボトルの容量を入力してください(%@)
ko: 물병 용량(%@)

source: マシュマロ(サポート)
ko: 마시멜로
